{"title": "Nim", "text": ["Nim is a mathematical game of strategy in which two players take turns removing (or \"nimming\") objects from distinct heaps or piles. On each turn, a player must remove at least one object, and may remove any number of objects provided they all come from the same heap or pile. Depending on the version being played, the goal of the game is either to avoid taking the last object or to take the last object.", "Variants of Nim have been played since ancient times. The game is said to have originated in China—it closely resembles the Chinese game of 捡石子 \"jiǎn-shízi\", or \"picking stones\"—but the origin is uncertain; the earliest European references to Nim are from the beginning of the 16th century. Its current name was coined by Charles L. Bouton of Harvard University, who also developed the complete theory of the game in 1901, but the origins of the name were never fully explained.", "Nim is typically played as a \"misère game\", in which the player to take the last object loses. Nim can also be played as a \"normal play\" game whereby the player taking the last object wins. This is called normal play because the last move is a winning move in most games, even though it is not the normal way that Nim is played. In either normal play or a misère game, when the number of heaps with at least two objects is exactly equal to one, the player who takes next can easily win. If this removes either all or all but one objects from the heap that has two or more, then no heaps will have more than one object, so the players are forced to alternate removing exactly one object until the game ends. If the player leaves an even number of non-zero heaps (as the player would do in normal play), the player takes last; if the player leaves an odd number of heaps (as the player would do in misère play), then the other player takes last.", "Normal play Nim (or more precisely the system of nimbers) is fundamental to the Sprague–Grundy theorem, which essentially says that in normal play every impartial game is equivalent to a Nim heap that yields the same outcome when played in parallel with other normal play impartial games (see disjunctive sum).", "While all normal play impartial games can be assigned a Nim value, that is not the case under the misère convention. Only tame games can be played using the same strategy as misère Nim.", "Nim is a special case of a poset game where the poset consists of disjoint chains (the heaps).", "The evolution graph of the game of Nim with three heaps is the same as three branches of the evolution graph of the Ulam-Warburton automaton.", "At the 1940 New York World's Fair Westinghouse displayed a machine, the Nimatron, that played Nim. From May 11, 1940, to October 27, 1940, only a few people were able to beat the machine in that six-week period; if they did, they were presented with a coin that said Nim Champ. It was also one of the first-ever electronic computerized games. Ferranti built a Nim playing computer which was displayed at the Festival of Britain in 1951. In 1952 Herbert Koppel, Eugene Grant and Howard Bailer, engineers from the W. L. Maxon Corporation, developed a machine weighing which played Nim against a human opponent and regularly won. A Nim Playing Machine has been described made from TinkerToy.", "The game of Nim was the subject of Martin Gardner's February 1958 Mathematical Games column in Scientific American. A version of Nim is played—and has symbolic importance—in the French New Wave film \"Last Year at Marienbad\" (1961).", "The normal game is between two players and is played with three heaps of any number of objects. The two players alternate taking any number of objects from any one of the heaps. The goal is to be the last to take an object. In misère play, the goal is instead to ensure that the opponent is forced to take the last remaining object.", "The following example of a normal game is played between fictional players Bob and Alice, who start with heaps of three, four and five objects.", "The practical strategy to win at the game of \"Nim\" is for a player to get the other into one of the following positions, and every successive turn afterwards they should be able to make one of the smaller positions. Only the last move changes between misere and normal play.", "* Only valid for normal play.", "** Only valid for misere.", "For the generalisations, \"n\" and \"m\" can be any value > 0, and they may be the same.", "Nim has been mathematically solved for any number of initial heaps and objects, and there is an easily calculated way to determine which player will win and which winning moves are open to that player.", "The key to the theory of the game is the binary digital sum of the heap sizes, i.e., the sum (in binary), neglecting all carries from one digit to another. This operation is also known as \"bitwise xor\" or \"vector addition over GF(2)\" (bitwise addition modulo 2). Within combinatorial game theory it is usually called the nim-sum, as it will be called here. The nim-sum of \"x\" and \"y\" is written to distinguish it from the ordinary sum, . An example of the calculation with heaps of size 3, 4, and 5 is as follows:", "An equivalent procedure, which is often easier to perform mentally, is to express the heap sizes as sums of distinct powers of 2, cancel pairs of equal powers, and then add what is left:", "In normal play, the winning strategy is to finish every move with a nim-sum of 0. This is always possible if the nim-sum is not zero before the move. If the nim-sum is zero, then the next player will lose if the other player does not make a mistake. To find out which move to make, let X be the nim-sum of all the heap sizes. Find a heap where the nim-sum of X and heap-size is less than the heap-size; the winning strategy is to play in such a heap, reducing that heap to the nim-sum of its original size with X. In the example above, taking the nim-sum of the sizes is . The nim-sums of the heap sizes A=3, B=4, and C=5 with X=2 are", "The only heap that is reduced is heap A, so the winning move is to reduce the size of heap A to 1 (by removing two objects).", "As a particular simple case, if there are only two heaps left, the strategy is to reduce the number of objects in the bigger heap to make the heaps equal. After that, no matter what move your opponent makes, you can make the same move on the other heap, guaranteeing that you take the last object.", "When played as a misère game, Nim strategy is different only when the normal play move would leave only heaps of size one. In that case, the correct move is to leave an odd number of heaps of size one (in normal play, the correct move would be to leave an even number of such heaps).", "These strategies for normal play and a misère game are the same until the number of heaps with at least two objects is exactly equal to one. At that point, the next player removes either all objects (or all but one) from the heap that has two or more, so no heaps will have more than one object (in other words, so all remaining heaps have exactly one object each), so the players are forced to alternate removing exactly one object until the game ends. In normal play, the player leaves an even number of non-zero heaps, so the same player takes last; in misère play, the player leaves an odd number of non-zero heaps, so the other player takes last.", "In a misère game with heaps of sizes three, four and five, the strategy would be applied like this:", "The soundness of the optimal strategy described above was demonstrated by C. Bouton.", "Theorem. In a normal Nim game, the player making the first move has a winning strategy if and only if the nim-sum of the sizes of the heaps is not zero. Otherwise, the second player has a winning strategy.", "\"Proof:\" Notice that the nim-sum (⊕) obeys the usual associative and commutative laws of addition (+) and also satisfies an additional property, \"x\" ⊕ \"x\" = 0.", "Let \"x\", ..., \"x\" be the sizes of the heaps before a move, and \"y\", ..., \"y\" the corresponding sizes after a move. Let \"s\" = \"x\" ⊕ ... ⊕ \"x\" and \"t\" = \"y\" ⊕ ... ⊕ \"y\". If the move was in heap \"k\", we have \"x\" = \"y\" for all \"i\" ≠ \"k\", and \"x\" > \"y\". By the properties of ⊕ mentioned above, we have", "The theorem follows by induction on the length of the game from these two lemmas.", "Lemma 1. If \"s\" = 0, then \"t\" ≠ 0 no matter what move is made.", "\"Proof:\" If there is no possible move, then the lemma is vacuously true (and the first player loses the normal play game by definition). Otherwise, any move in heap \"k\" will produce \"t\" = \"x\" ⊕ \"y\" from (*). This number is nonzero, since \"x\" ≠ \"y\".", "Lemma 2. If \"s\" ≠ 0, it is possible to make a move so that \"t\" = 0.", "\"Proof:\" Let \"d\" be the position of the leftmost (most significant) nonzero bit in the binary representation of \"s\", and choose \"k\" such that the \"d\"th bit of \"x\" is also nonzero. (Such a \"k\" must exist, since otherwise the \"d\"th bit of \"s\" would be 0.)", "Then letting \"y\" = \"s\" ⊕ \"x\", we claim that \"y\" < \"x\": all bits to the left of \"d\" are the same in \"x\" and \"y\", bit \"d\" decreases from 1 to 0 (decreasing the value by 2), and any change in the remaining bits will amount to at most 2−1. The first player can thus make a move by taking \"x\" − \"y\" objects from heap \"k\", then", "The modification for misère play is demonstrated by noting that the modification first arises in a position that has only one heap of size 2 or more. Notice that in such a position \"s\" ≠ 0, and therefore this situation has to arise when it is the turn of the player following the winning strategy. The normal play strategy is for the player to reduce this to size 0 or 1, leaving an even number of heaps with size 1, and the misère strategy is to do the opposite. From that point on, all moves are forced.", "In another game which is commonly known as Nim (but is better called the subtraction game), an upper bound is imposed on the number of objects that can be removed in a turn. Instead of removing arbitrarily many objects, a player can only remove 1 or 2 or ... or \"k\" at a time. This game is commonly played in practice with only one heap.", "Bouton's analysis carries over easily to the general multiple-heap version of this game. The only difference is that as a first step, before computing the Nim-sums we must reduce the sizes of the heaps modulo \"k\" + 1. If this makes all the heaps of size zero (in misère play), the winning move is to take \"k\" objects from one of the heaps. In particular, in ideal play from a single heap of \"n\" objects, the second player can win if and only if", "This follows from calculating the nim-sequence of \"S\"(1,2...,\"k\"),", "from which the strategy above follows by the Sprague–Grundy theorem.", "The game \"21\" is played as a misère game with any number of players who take turns saying a number. The first player says \"1\" and each player in turn increases the number by 1, 2, or 3, but may not exceed 21; the player forced to say \"21\" loses. This can be modeled as a subtraction game with a heap of 21–\"n\" objects. The winning strategy for the two-player version of this game is to always say a multiple of 4; it is then guaranteed that the other player will ultimately have to say 21; so in the standard version, wherein the first player opens with \"1\", they start with a losing move.", "The 21 game can also be played with different numbers, e.g., \"Add at most 5; lose on 34\".", "A sample game of 21 in which the second player follows the winning strategy:", "A similar version is the \"100 game\": Two players start from 0 and alternately add a number from 1 to 10 to the sum. The player who reaches 100 wins. The winning strategy is to reach a number in which the digits are subsequent (e.g., 01, 12, 23, 34...) and control the game by jumping through all the numbers of this sequence. Once a player reaches 89, the opponent can only choose numbers from 90 to 99, and the next answer can in any case be 100.", "In another variation of Nim, besides removing any number of objects from a single heap, one is permitted to remove the same number of objects from each heap.", "Yet another variation of Nim is 'Circular Nim', wherein any number of objects are placed in a circle and two players alternately remove one, two or three adjacent objects. For example, starting with a circle of ten objects,", "three objects are taken in the first move", "then another three", "then one", "but then three objects cannot be taken out in one move.", "In Grundy's game, another variation of Nim, a number of objects are placed in an initial heap and two players alternately divide a heap into two nonempty heaps of different sizes. Thus, six objects may be divided into piles of 5+1 or 4+2, but not 3+3. Grundy's game can be played as either misère or normal play.", "\"Greedy Nim\" is a variation wherein the players are restricted to choosing stones from only the largest pile. It is a finite impartial game. \"Greedy Nim Misère\" has the same rules as Greedy Nim, but here the last player able to make a move loses.", "Let the largest number of stones in a pile be \"m\" and the second largest number of stones in a pile be \"n\". Let \"p\" be the number of piles having \"m\" stones and \"p\" be the number of piles having \"n\" stones. Then there is a theorem that game positions with \"p\" even are \"P\" positions.", "Thus, there exists a move to a state where \"p\" is even. Conversely, if \"p\" is even, if any move is possible (\"p\" ≠ 0), then it must take the game to a state where \"p\" is odd. The final position of the game is even (\"p\" = 0). Hence, each position of the game with \"p\" even must be a \"P\" position.", "A generalization of multi-heap Nim was called \"Nimformula_2\" or \"index-\"k\"\" Nim by E. H. Moore, who analyzed it in 1910. In index-\"k\" Nim, instead of removing objects from only one heap, players can remove objects from at least one but up to \"k\" different heaps. The number of elements that may be removed from each heap may be either arbitrary or limited to at most \"r\" elements, like in the \"subtraction game\" above.", "The winning strategy is as follows: Like in ordinary multi-heap Nim, one considers the binary representation of the heap sizes (or heap sizes modulo \"r\" + 1). In ordinary Nim one forms the XOR-sum (or sum modulo 2) of each binary digit, and the winning strategy is to make each XOR sum zero. In the generalization to index-\"k\" Nim, one forms the sum of each binary digit modulo \"k\" + 1.", "Again the winning strategy is to move such that this sum is zero for every digit. Indeed, the value thus computed is zero for the final position, and given a configuration of heaps for which this value is zero, any change of at most \"k\" heaps will make the value non-zero. Conversely, given a configuration with non-zero value, one can always take from at most \"k\" heaps, carefully chosen, so that the value will become zero.", "Building Nim is a variant of Nim wherein the two players first construct the game of Nim. Given \"n\" stones and \"s\" empty piles, the players, alternating turns, place exactly one stone into a pile of their choice. Once all the stones are placed, a game of Nim begins, starting with the next player that would move. This game is denoted \"BN(n,s)\".", "\"n\"-d Nim is played on a formula_3 board, whereon any number of continuous pieces can be removed from any hyper-row. The starting position is usually the full board, but other options are allowed.", "The starting board is a disconnected graph, and players take turns to remove adjacent vertices.", "Candy Nim is a version of normal play Nim in which players try to achieve two goals at the same time: taking the last object (in this case, candy) and taking the maximum number of candies by the end of the game.", "Wordnim is the verbal version of Nim where players form words from initial sets or series of letters until none are left or no legitimate word can be formed."]}
{"title": "Ninon de l'Enclos", "text": ["Anne \"Ninon\" de l'Enclos, also spelled Ninon de Lenclos and Ninon de Lanclos (10 November 1620 – 17 October 1705), was a French author, courtesan and patron of the arts.", "Born Anne de l'Enclos in Paris on 10 November 1620, she was nicknamed \"Ninon\" at an early age by her father, Henri de l'Enclos, a lutenist and published composer, who taught her to sing and play the lute. In 1632, he was exiled from France after a duel. When Ninon's mother, Marie Barbe , died ten years later, the unmarried Ninon entered a convent, only to leave the next year. For the remainder of her life she was determined to remain unmarried and independent.", "Returning to Paris, she became a popular figure in the salons, and her own drawing room became a centre for the discussion and consumption of the literary arts. In her early thirties she was responsible for encouraging the young Molière, and when she died she left money for the son of her notary, a nine-year-old named François-Marie Arouet, later to become known as Voltaire, so he could buy books.", "It was during this period that her life as a courtesan began. Ninon took a succession of notable and wealthy lovers, including the king's cousin the Great Condé, Gaston de Coligny, and François, duc de La Rochefoucauld. These men did not support her, however; she prided herself on her independent income. \"Ninon always had crowds of adorers but never more than one lover at a time, and when she tired of the present occupier, she said so frankly and took another. Yet such was the authority of this wanton, that no man dared fall out with his successful rival; he was only too happy to be allowed to visit as a familiar friend,\" Saint-Simon wrote. In 1652, Ninon took up with Louis de Mornay, the marquis de Villarceaux, by whom she had a son, also named Louis. She lived with the marquis until 1655, when she returned to Paris. When she would not return to him, the marquis fell into a fever; to console him, Ninon cut her hair and sent the shorn locks to him, starting a vogue for bobbed hair \"à la Ninon\".", "This life (less acceptable in her time than it would become in later years) and her opinions on organised religion caused her some trouble, and she was imprisoned in the Madelonnettes Convent in 1656 at the behest of Anne of Austria, Queen of France and regent for her son Louis XIV. Not long after, however, she was visited by Christina, former queen of Sweden. Impressed, Christina wrote to Cardinal Mazarin on Ninon's behalf and arranged for her release.", "In response, as an author she defended the possibility of living a good life in the absence of religion, notably in 1659's \"La coquette vengée\" (\"The Flirt Avenged\"). She was also noted for her wit; among her numerous sayings and quips are \"Much more genius is needed to make love than to command armies\" and \"We should take care to lay in a stock of provisions, but not of pleasures: these should be gathered day by day.\" A picture of Ninon, under the name of Damo, was sketched in Mlle. de Scudéry's \"Clélie\" (1654–1661).", "Starting in the late 1660s she retired from her courtesan lifestyle and concentrated more on her literary friends – from 1667, she hosted her gatherings at \"l'hôtel Sagonne\", which was considered \"the\" location of the salon of Ninon de l'Enclos despite other locales in the past. During this time she was a friend of Jean Racine, the great French playwright. Later she would become a close friend with the devout Françoise d'Aubigné, better known as Madame de Maintenon, the lady-in-waiting who would later become the second wife of Louis XIV. Saint-Simon wrote that \"The lady did not like her to be mentioned in her presence, but dared not disown her, and wrote cordial letters to her from time to time, to the day of her death\". Ninon eventually died at the age of 84, as a very wealthy woman. To the end, she \"was convinced that she had no soul, and never abandoned that conviction, not even in advanced old age, not even at the hour of her death.\"", "Ninon de l'Enclos is a relatively obscure figure in the English-speaking world, but is much better known in France where her name is synonymous with wit and beauty. Saint-Simon noted \"Ninon made friends among the great in every walk of life, had wit and intelligence enough to keep them, and, what is more, to keep them friendly with one another.\"", "Edgar Allan Poe mentioned her in his short story \"The spectacles,\" as did Rudyard Kipling the \"Venus Annodomini\". Edwin Arlington Robinson used Ninon as a symbol of aging beauty in his poem \"Veteran Sirens.\" Dorothy Parker wrote the poem \"Ninon De L'Enclos On Her Last Birthday\" and also referred to Ninon in another of her poems, \"Words Of Comfort To Be Scratched On A Mirror\". L'Enclos is the eponymous heroine of Charles Lecocq's 1896 opéra comique, \"Ninette\".", "The 1911 edition of Encyclopædia Britannica lists her date of birth being in November 1615."]}
{"title": "National Institute of Standards and Technology", "text": ["The National Institute of Standards and Technology (NIST) is a physical sciences laboratory and non-regulatory agency of the United States Department of Commerce. Its mission is to promote American innovation and industrial competitiveness. NIST's activities are organized into laboratory programs that include nanoscale science and technology, engineering, information technology, neutron research, material measurement, and physical measurement. From 1901 to 1988, the agency was named the National Bureau of Standards.", "The Articles of Confederation, ratified by the colonies in 1781, provided:", "The United States in Congress assembled shall also have the sole and exclusive right and power of regulating the alloy and value of coin struck by their own authority, or by that of the respective states—fixing the standards of weights and measures throughout the United States.", "Article 1, section 8, of the Constitution of the United States, ratified in 1789, granted these powers to the new Congress: \"The Congress shall have power ... To coin money, regulate the value thereof, and of foreign coin, and fix the standard of weights and measures\".", "In January 1790, President George Washington, in his first annual message to Congress, said, \"Uniformity in the currency, weights, and measures of the United States is an object of great importance, and will, I am persuaded, be duly attended to.\" Washington ordered Secretary of State Thomas Jefferson to prepare a Plan for Establishing Uniformity in the Coinage, Weights, and Measures of the United States, later referred to informally as the Jefferson Report.", "On October 25, 1791, Washington again appealed Congress:", "A uniformity of the weights and measures of the country is among the important objects submitted to you by the Constitution and if it can be derived from a standard at once invariable and universal, must be no less honorable to the public council than conducive to the public convenience.", "In 1821, President John Quincy Adams declared, \"Weights and measures may be ranked among the necessities of life to every individual of human society.\". Nevertheless, it was not until 1838 that the United States government adopted a uniform set of standards.", "From 1830 until 1901, the role of overseeing weights and measures was carried out by the Office of Standard Weights and Measures, which was part of the United States Coast and Geodetic Survey in the Department of the Treasury.", "In 1901, in response to a bill proposed by Congressman James H. Southard (R, Ohio), the National Bureau of Standards was founded with the mandate to provide standard weights and measures, and to serve as the national physical laboratory for the United States. Southard had previously sponsored a bill for metric conversion of the United States.", "President Theodore Roosevelt appointed Samuel W. Stratton as the first director. The budget for the first year of operation was $40,000. The Bureau took custody of the copies of the kilogram and meter bars that were the standards for US measures, and set up a program to provide metrology services for United States scientific and commercial users. A laboratory site was constructed in Washington, DC, and instruments were acquired from the national physical laboratories of Europe. In addition to weights and measures, the Bureau developed instruments for electrical units and for measurement of light. In 1905 a meeting was called that would be the first \"National Conference on Weights and Measures\".", "Initially conceived as purely a metrology agency, the Bureau of Standards was directed by Herbert Hoover to set up divisions to develop commercial standards for materials and products. Some of these standards were for products intended for government use, but product standards also affected private-sector consumption. Quality standards were developed for products including some types of clothing, automobile brake systems and headlamps, antifreeze, and electrical safety. During World War I, the Bureau worked on multiple problems related to war production, even operating its own facility to produce optical glass when European supplies were cut off. Between the wars, Harry Diamond of the Bureau developed a blind approach radio aircraft landing system. During World War II, military research and development was carried out, including development of radio propagation forecast methods, the proximity fuze and the standardized airframe used originally for Project Pigeon, and shortly afterwards the autonomously radar-guided Bat anti-ship guided bomb and the Kingfisher family of torpedo-carrying missiles.", "In 1948, financed by the United States Air Force, the Bureau began design and construction of SEAC, the Standards Eastern Automatic Computer. The computer went into operation in May 1950 using a combination of vacuum tubes and solid-state diode logic. About the same time the Standards Western Automatic Computer, was built at the Los Angeles office of the NBS by Harry Huskey and used for research there. A mobile version, DYSEAC, was built for the Signal Corps in 1954.", "Due to a changing mission, the \"National Bureau of Standards\" became the \"National Institute of Standards and Technology\" in 1988.", "Following September 11, 2001, NIST conducted the official investigation into the collapse of the World Trade Center buildings.", "Following the 2021 Surfside condominium building collapse, NIST sent engineers to the site to investigate the cause of the collapse.", "In 2019, NIST launched a program named NIST on a Chip to decrease the size of instruments from lab machines to chip size. Applications include aircraft testing, communication with satellites for navigation purposes, and temperature and pressure.", "NIST, known between 1901 and 1988 as the National Bureau of Standards (NBS), is a measurement standards laboratory, also known as the National Metrological Institute (NMI), which is a non-regulatory agency of the United States Department of Commerce. The institute's official mission is to:", "NIST had an operating budget for fiscal year 2007 (October 1, 2006September 30, 2007) of about $843.3 million. NIST's 2009 budget was $992 million, and it also received $610 million as part of the American Recovery and Reinvestment Act. NIST employs about 2,900 scientists, engineers, technicians, and support and administrative personnel. About 1,800 NIST associates (guest researchers and engineers from American companies and foreign countries) complement the staff. In addition, NIST partners with 1,400 manufacturing specialists and staff at nearly 350 affiliated centers around the country. NIST publishes the Handbook 44 that provides the \"Specifications, tolerances, and other technical requirements for weighing and measuring devices\".", "The Congress of 1866 made use of the metric system in commerce a legally protected activity through the passage of Metric Act of 1866. On May 20, 1875, 17 out of 20 countries signed a document known as the \"Metric Convention\" or the \"Treaty of the Meter\", which established the International Bureau of Weights and Measures under the control of an international committee elected by the General Conference on Weights and Measures.", "NIST is headquartered in Gaithersburg, Maryland, and operates a facility in Boulder, Colorado, which was dedicated by President Eisenhower in 1954. NIST's activities are organized into laboratory programs and extramural programs. Effective October 1, 2010, NIST was realigned by reducing the number of NIST laboratory units from ten to six. NIST Laboratories include:", "Extramural programs include:", "NIST also operates a neutron science user facility: the NIST Center for Neutron Research (NCNR). The NCNR provides scientists access to a variety of neutron scattering instruments, which they use in many research fields (materials science, fuel cells, biotechnology, etc.).", "The SURF III Synchrotron Ultraviolet Radiation Facility is a source of synchrotron radiation, in continuous operation since 1961. SURF III now serves as the US national standard for source-based radiometry throughout the generalized optical spectrum. All NASA-borne, extreme-ultraviolet observation instruments have been calibrated at SURF since the 1970s, and SURF is used for measurement and characterization of systems for extreme ultraviolet lithography.", "The Center for Nanoscale Science and Technology (CNST) performs research in nanotechnology, both through internal research efforts and by running a user-accessible cleanroom nanomanufacturing facility. This \"NanoFab\" is equipped with tools for lithographic patterning and imaging (e.g., electron microscopes and atomic force microscopes).", "NIST has seven standing committees:", "As part of its mission, NIST supplies industry, academia, government, and other users with over 1,300 Standard Reference Materials (SRMs). These artifacts are certified as having specific characteristics or component content, used as calibration standards for measuring equipment and procedures, quality control benchmarks for industrial processes, and experimental control samples.", "NIST publishes the \"Handbook 44\" each year after the annual meeting of the National Conference on Weights and Measures (NCWM). Each edition is developed through cooperation of the Committee on Specifications and Tolerances of the NCWM and the Weights and Measures Division (WMD) of the NIST. The purpose of the book is a partial fulfillment of the statutory responsibility for \"cooperation with the states in securing uniformity of weights and measures laws and methods of inspection\".", "NIST has been publishing various forms of what is now the \"Handbook 44\" since 1918 and began publication under the current name in 1949. The 2010 edition conforms to the concept of the primary use of the SI (metric) measurements recommended by the Omnibus Foreign Trade and Competitiveness Act of 1988.", "NIST is developing government-wide identity document standards for federal employees and contractors to prevent unauthorized persons from gaining access to government buildings and computer systems.", "In 2002, the National Construction Safety Team Act mandated NIST to conduct an investigation into the collapse of the World Trade Center buildings 1 and 2 and the 47-story 7 World Trade Center. The \"World Trade Center Collapse Investigation\", directed by lead investigator Shyam Sunder, covered three aspects, including a technical building and fire safety investigation to study the factors contributing to the probable cause of the collapses of the WTC Towers (WTC 1 and 2) and WTC 7. NIST also established a research and development program to provide the technical basis for improved building and fire codes, standards, and practices, and a dissemination and technical assistance program to engage leaders of the construction and building community in implementing proposed changes to practices, standards, and codes. NIST also is providing practical guidance and tools to better prepare facility owners, contractors, architects, engineers, emergency responders, and regulatory authorities to respond to future disasters. The investigation portion of the response plan was completed with the release of the final report on 7 World Trade Center on November 20, 2008. The final report on the WTC Towers—including 30 recommendations for improving building and occupant safety—was released on October 26, 2005.", "NIST works in conjunction with the Technical Guidelines Development Committee of the Election Assistance Commission to develop the Voluntary Voting System Guidelines for voting machines and other election technology.", "In February 2014 NIST published the NIST Cybersecurity Framework that serves as voluntary guidance for organizations to manage and reduce cybersecurity risk.", "It was later amended and Version 1.1 was published in April 2018.", "Executive Order 13800, Strengthening the Cybersecurity of Federal Networks and Critical Infrastructure, made the Framework mandatory for U.S. federal government agencies.", "Four scientific researchers at NIST have been awarded Nobel Prizes for work in physics: William Daniel Phillips in 1997, Eric Allin Cornell in 2001, John Lewis Hall in 2005 and David Jeffrey Wineland in 2012, which is the largest number for any US government laboratory. All four were recognized for their work related to laser cooling of atoms, which is directly related to the development and advancement of the atomic clock. In 2011, Dan Shechtman was awarded the Nobel Prize in chemistry for his work on quasicrystals in the Metallurgy Division from 1982 to 1984. In addition, John Werner Cahn was awarded the 2011 Kyoto Prize for Materials Science, and the National Medal of Science has been awarded to NIST researchers Cahn (1998) and Wineland (2007). Other notable people who have worked at NBS or NIST include:", "Since 1989, the director of NIST has been a Presidential appointee and is confirmed by the United States Senate, and since that year the average tenure of NIST directors has fallen from 11 years to 2 years in duration. Since the 2011 reorganization of NIST, the director also holds the title of Under Secretary of Commerce for Standards and Technology. Fifteen individuals have officially held the position (in addition to four acting directors who have served on a temporary basis).", "The NIST holds patents on behalf of the Federal government of the United States, with at least one of them being custodial to protect public domain use, such as one for a Chip-scale atomic clock, developed by a NIST team as part of a DARPA competition.", "In September 2013, both \"The Guardian\" and \"The New York Times\" reported that NIST allowed the National Security Agency (NSA) to insert a cryptographically secure pseudorandom number generator called Dual EC DRBG into NIST standard SP 800-90 that had a kleptographic backdoor that the NSA can use to covertly predict the future outputs of this pseudorandom number generator thereby allowing the surreptitious decryption of data. Both papers report that the NSA worked covertly to get its own version of SP 800-90 approved for worldwide use in 2006. The whistle-blowing document states that \"eventually, NSA became the sole editor\". The reports confirm suspicions and technical grounds publicly raised by cryptographers in 2007 that the EC-DRBG could contain a kleptographic backdoor (perhaps placed in the standard by NSA).", "NIST responded to the allegations, stating that \"NIST works to publish the strongest cryptographic standards possible\" and that it uses \"a transparent, public process to rigorously vet our recommended standards\". The agency stated that \"there has been some confusion about the standards development process and the role of different organizations in it...The National Security Agency (NSA) participates in the NIST cryptography process because of its recognized expertise. NIST is also required by statute to consult with the NSA.\" Recognizing the concerns expressed, the agency reopened the public comment period for the SP800-90 publications, promising that \"if vulnerabilities are found in these or any other NIST standards, we will work with the cryptographic community to address them as quickly as possible”. Due to public concern of this cryptovirology attack, NIST rescinded the EC-DRBG algorithm from the NIST SP 800-90 standard."]}
{"title": "NATO reporting name", "text": ["NATO reporting names are code names for military equipment from Russia, China, and historically, the Eastern Bloc (Soviet Union and other nations of the Warsaw Pact). They provide unambiguous and easily understood English words in a uniform manner in place of the original designations, which either may have been unknown to the Western world at the time or easily confused codes. For example, the Russian bomber jet Tupolev Tu-160 is simply called \"Blackjack\".", "NATO maintains lists of the names. The assignment of the names for the Russian and Chinese aircraft was once managed by the five-nation Air Standardization Coordinating Committee (ASCC), but that is no longer the case.", "The United States Department of Defense (DOD) expands on the NATO reporting names in some cases. NATO refers to surface-to-air missile systems mounted on ships or submarines with the same names as the corresponding land-based systems, but the US DoD assigns a different series of numbers with a different suffix (i.e., SA-N- vis-à-vis. SA-) for these systems. The names are kept the same as a convenience. Where there is no corresponding system, a new name is devised.", "The Soviet Union did not always assign official \"popular names\" to its aircraft, but unofficial nicknames were common as in any air force. Generally, Soviet pilots did not use the NATO names, preferring a different, Russian, nickname. An exception was that Soviet airmen appreciated the MiG-29's codename \"Fulcrum\", as an indication of its pivotal role in Soviet air defence.", "To reduce the risk of confusion, unusual or made-up names were allocated, the idea being that the names chosen would be unlikely to occur in normal conversation, and be easier to memorise. For fixed-wing aircraft, single-syllable words denoted piston-prop and turboprop, while multiple-syllable words denoted jets.", "Bombers had names starting with the letter 'B' and names like \"Badger\" (Tupolev Tu-16), \"Blackjack\" (Tupolev Tu-160) and \"Bear\" (Tupolev Tu-95) were used. \"Frogfoot,\" the reporting name for the Sukhoi Su-25, references the aircraft's close air support role. Transports had names starting with 'C' (for \"cargo\"), which resulted in names like \"Condor\" for the Antonov An-124 or \"Candid\" for the Ilyushin Il-76.", "The initial letter of the name indicated the use of that equipment.", "The first letter indicates the type of aircraft, like eg 'Bear' for a bomber aircraft refers to the Tupolev Tu-95, or 'Fulcrum' for the Mikoyan-Gurevich MiG-29 fighter aircraft. For fixed-wing aircraft, one-syllable names are used for propeller aircraft and two-syllable name for aircraft with jet engines. This distinction is not made for helicopters.", "Before the 1980s, reporting names for submarines were taken from the NATO spelling alphabet. Modifications of existing designs were given descriptive terms, such as \"Whiskey Long Bin\". From the 1980s, new designs were given names derived from Russian words, such as \"Akula\", or \"shark\". These names did not correspond to the Soviet names. Coincidentally, \"Akula\", which was assigned to an attack submarine by NATO, was the actual Soviet name for the ballistic missile submarine NATO named \"Typhoon-class\". The NATO names for submarines of the People's Republic of China are taken from Chinese dynasties."]}
{"title": "List of NATO reporting names for surface-to-surface missiles", "text": ["NATO reporting name for SS series surface-to-surface missiles, with Soviet designations:", "US DoD designations for SS-N series naval surface-to-surface missiles (fired from ships and submarines), with Soviet designations:", "\"See also\": NATO reporting name"]}
{"title": "List of NATO reporting names for air-to-air missiles", "text": ["NATO reporting name for AA series air-to-air missiles, with Soviet designations:", "\"See also\": NATO reporting name"]}
{"title": "List of NATO reporting names for air-to-surface missiles", "text": ["NATO reporting name for AS series air-to-surface missiles, with Soviet designations:", "Note: The Soviet / Russian designation is a Cyrillic letter \"Х\", which is translated as \"Kh\" or \"H\". Also, sometimes a combination (\"complex\") of a missile with its aircraft is marked with a letter \"K\" (for example, a missile Kh-22 with an aircraft is a \"complex K-22\"). The Cyrillic \"X\" (read \"Kh\") in the designation of Soviet ASMs is in fact a Latin \"X\" (\"ecks\") for Xperimental, as used by the design bureau. With passing time, however, this was ignored and used in Soviet/Russian as well as foreign literature as the Cyrillic Kh."]}
{"title": "List of NATO reporting names for anti-tank missiles", "text": ["NATO reporting name for AT series anti-tank guided missiles, with Soviet designations:"]}
{"title": "List of NATO reporting names for surface-to-air missiles", "text": ["NATO reporting name for SA series surface-to-air missiles, with Soviet designations:", "U.S. DoD designations for SA-N series naval surface-to-air missiles, with Soviet designations. Note that these are not standard NATO names, NATO uses the regular SA series for naval SAMS also, however the US DoD refers to them by these names:"]}
{"title": "List of NATO reporting names for bomber aircraft", "text": ["This is a list of NATO reporting name/ASCC names for bombers, with Soviet Union and Chinese designations. Bombers had names starting with the letter \"B\"; single-syllable words denoted propeller driven aircraft (piston and turboprop engines), while two syllable words were used for jets."]}
